<a href="https://colab.research.google.com/github/Mgobeaalcoba/Full_Pandas/blob/main/maths.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from google.colab import drive 
drive.mount("/content/drive")

Mounted at /content/drive

In [5]:
import numpy as np

In [6]:
dir_pandas = '/content/drive/My Drive/Colab Notebooks/db/{}'
dir_pandas

'/content/drive/My Drive/Colab Notebooks/db/{}'

In [17]:
df = pd.read_csv(dir_pandas.format("london_merged.csv")).copy(deep=True)
df.head(5)

             timestamp  cnt   t1  ...  is_holiday  is_weekend  season
0  2015-01-04 00:00:00  182  3.0  ...         0.0         1.0     3.0
1  2015-01-04 01:00:00  138  3.0  ...         0.0         1.0     3.0
2  2015-01-04 02:00:00  134  2.5  ...         0.0         1.0     3.0
3  2015-01-04 03:00:00   72  2.0  ...         0.0         1.0     3.0
4  2015-01-04 04:00:00   47  2.0  ...         0.0         1.0     3.0

[5 rows x 10 columns]

In [18]:
df.dtypes

timestamp        object
cnt               int64
t1              float64
t2              float64
hum             float64
wind_speed      float64
weather_code    float64
is_holiday      float64
is_weekend      float64
season          float64
dtype: object

In [21]:
#Voy a transformar "timestamp" de un string a un datetime

df["timestamp"] = pd.to_datetime(
df["timestamp"],
errors = "coerce",
format = "%d/%m/%Y %H:%M:%S %p")
df["timestamp"]

0       2015-01-04 00:00:00
1       2015-01-04 01:00:00
2       2015-01-04 02:00:00
3       2015-01-04 03:00:00
4       2015-01-04 04:00:00
                ...
17409   2017-01-03 19:00:00
17410   2017-01-03 20:00:00
17411   2017-01-03 21:00:00
17412   2017-01-03 22:00:00
17413   2017-01-03 23:00:00
Name: timestamp, Length: 17414, dtype: datetime64[ns]

**Al haber transformado mi columna a un datetime ahora puedo extraer solo la hora y guardarlo en una nueva columna. ¿Como?**

In [22]:
df["hour"] = df["timestamp"].dt.hour
df.head(5)

            timestamp  cnt   t1   t2  ...  is_holiday  is_weekend  season  hour
0 2015-01-04 00:00:00  182  3.0  2.0  ...         0.0         1.0     3.0     0
1 2015-01-04 01:00:00  138  3.0  2.5  ...         0.0         1.0     3.0     1
2 2015-01-04 02:00:00  134  2.5  2.5  ...         0.0         1.0     3.0     2
3 2015-01-04 03:00:00   72  2.0  2.0  ...         0.0         1.0     3.0     3
4 2015-01-04 04:00:00   47  2.0  0.0  ...         0.0         1.0     3.0     4

[5 rows x 11 columns]

In [23]:
df.dtypes

timestamp       datetime64[ns]
cnt                      int64
t1                     float64
t2                     float64
hum                    float64
wind_speed             float64
weather_code           float64
is_holiday             float64
is_weekend             float64
season                 float64
hour                     int64
dtype: object

In [24]:
list(df)

['timestamp',
 'cnt',
 't1',
 't2',
 'hum',
 'wind_speed',
 'weather_code',
 'is_holiday',
 'is_weekend',
 'season',
 'hour']

**A traves del uso de rebanadas en las filas y columans y el metodo iloc yo puedo recortar mi df original. Por ejemplo. Ahora que tengo la hora podría quitar el timestamp**

In [28]:
df2 = df.iloc[:,1:] # Recordar que iloc no lleva parentesis sino solo la rebanada que vamos a usar. Primero las filas y luego las columnas
df2.head(5)

   cnt   t1   t2    hum  ...  is_holiday  is_weekend  season  hour
0  182  3.0  2.0   93.0  ...         0.0         1.0     3.0     0
1  138  3.0  2.5   93.0  ...         0.0         1.0     3.0     1
2  134  2.5  2.5   96.5  ...         0.0         1.0     3.0     2
3   72  2.0  2.0  100.0  ...         0.0         1.0     3.0     3
4   47  2.0  0.0   93.0  ...         0.0         1.0     3.0     4

[5 rows x 10 columns]

In [29]:
df2.dtypes

cnt               int64
t1              float64
t2              float64
hum             float64
wind_speed      float64
weather_code    float64
is_holiday      float64
is_weekend      float64
season          float64
hour              int64
dtype: object

**Ahora tengo un dataframe (df2) 100% númerico con el que puedo hacer distintos tipos de operaciones matematicas**

In [32]:
# Por ej elevo la velocidad del viento al cuadrado
df2["wind_speed"] = df2["wind_speed"] ** 2
df2

        cnt   t1   t2    hum  ...  is_holiday  is_weekend  season  hour
0       182  3.0  2.0   93.0  ...         0.0         1.0     3.0     0
1       138  3.0  2.5   93.0  ...         0.0         1.0     3.0     1
2       134  2.5  2.5   96.5  ...         0.0         1.0     3.0     2
3        72  2.0  2.0  100.0  ...         0.0         1.0     3.0     3
4        47  2.0  0.0   93.0  ...         0.0         1.0     3.0     4
...     ...  ...  ...    ...  ...         ...         ...     ...   ...
17409  1042  5.0  1.0   81.0  ...         0.0         0.0     3.0    19
17410   541  5.0  1.0   81.0  ...         0.0         0.0     3.0    20
17411   337  5.5  1.5   78.5  ...         0.0         0.0     3.0    21
17412   224  5.5  1.5   76.0  ...         0.0         0.0     3.0    22
17413   139  5.0  1.0   76.0  ...         0.0         0.0     3.0    23

[17414 rows x 10 columns]

Tmb puedo aplicar funciones matematicas mas complejas como sena ayudado por numpy

In [34]:
np.sin(df2["wind_speed"])

0       -0.991779
1       -0.132352
2        0.000000
3        0.000000
4       -0.986987
           ...
17409    0.279387
17410    0.923470
17411   -0.885953
17412    0.936473
17413    0.193503
Name: wind_speed, Length: 17414, dtype: float64

**Entre columnas yo puedo hacer las operaciones matematicas que yo quiera**

In [36]:
(df2["t1"] - df2["t2"]).iloc[::3] #Veo la diferencia entre sens termica y temperatura cada 3 filas

0        1.0
3        0.0
6        2.0
9        2.5
12       3.5
        ...
17400    5.0
17403    4.0
17406    4.0
17409    4.0
17412    4.0
Length: 5805, dtype: float64

In [37]:
df2["t1"].iloc[::3] - df2["t2"] # Los que no seleccione de t1 me los muestra como NaN

0        1.0
1        NaN
2        NaN
3        0.0
4        NaN
        ...
17409    4.0
17410    NaN
17411    NaN
17412    4.0
17413    NaN
Length: 17414, dtype: float64

**Para que no aparezca NaN debo definir un valor por defecto para esos valores y ara ello tengo que restar usando la función de pandas que se llama .sub y dentro de ella usar el argumento fill_value=**

In [39]:
df2["t1"].iloc[::3].sub(df["t2"], fill_value=1000)

0           1.0
1         997.5
2         997.5
3           0.0
4        1000.0
          ...
17409       4.0
17410     999.0
17411     998.5
17412       4.0
17413     999.0
Length: 17414, dtype: float64

**Para hacer operaciones matematicas mas complejas debemos usar funciones lambda**

In [40]:
def fun_1(x):
  return x**2+1

In [41]:
fun_1(10)

101

In [42]:
array = np.arange(-5,6)
array

array([-5, -4, -3, -2, -1,  0,  1,  2,  3,  4,  5])

In [43]:
array.shape

(11,)

In [44]:
fun_1(array)

array([26, 17, 10,  5,  2,  1,  2,  5, 10, 17, 26])

In [54]:
fun_1(df2["hour"]) # Tmb se pueden usar funciones sobre una columna o un dataframe con el metodo .apply

0          1
1          2
2          5
3         10
4         17
        ...
17409    362
17410    401
17411    442
17412    485
17413    530
Name: hour, Length: 17414, dtype: int64

In [55]:
df2["hour"].apply(fun_1)

0          1
1          2
2          5
3         10
4         17
        ...
17409    362
17410    401
17411    442
17412    485
17413    530
Name: hour, Length: 17414, dtype: int64

In [56]:
def fun_2(x, a=1, b=0):
  return x**2 + a*x + b

In [62]:
fun_2(df["hour"],a=2,b=4)

0          4
1          7
2         12
3         19
4         28
        ...
17409    403
17410    444
17411    487
17412    532
17413    579
Name: hour, Length: 17414, dtype: int64

In [63]:
fun_2(df["hour"],2,4)

0          4
1          7
2         12
3         19
4         28
        ...
17409    403
17410    444
17411    487
17412    532
17413    579
Name: hour, Length: 17414, dtype: int64

In [61]:
df["hour"].apply(fun_2, args = (2, 4))

0          4
1          7
2         12
3         19
4         28
        ...
17409    403
17410    444
17411    487
17412    532
17413    579
Name: hour, Length: 17414, dtype: int64

In [64]:
df["hour"].apply(fun_2, a=2 , b=4)

0          4
1          7
2         12
3         19
4         28
        ...
17409    403
17410    444
17411    487
17412    532
17413    579
Name: hour, Length: 17414, dtype: int64

**Son 4 formas de trabajar dataframes o series con funciones matematicas mas complejas.
Una forma mucho mas rapida es definir la función como una lambda luego del .apply**

In [66]:
df2["t1"].apply(lambda x: x+273) # El problema con la lambda es que no la puedo re utilizar

0        276.0
1        276.0
2        275.5
3        275.0
4        275.0
         ...
17409    278.0
17410    278.0
17411    278.5
17412    278.5
17413    278.0
Name: t1, Length: 17414, dtype: float64

**Con funciones lambda puedo obtener el promedio de cada una de mis columnas**

In [67]:
df2.apply(lambda x: x.mean())

cnt             1143.101642
t1                12.468091
t2                11.520836
hum               72.324954
wind_speed       315.546244
weather_code       2.722752
is_holiday         0.022051
is_weekend         0.285403
season             1.492075
hour              11.513265
dtype: float64

In [68]:
df2.mean() # Lo mismo puedo conseguir aplicando el mean al dataframe directamente

cnt             1143.101642
t1                12.468091
t2                11.520836
hum               72.324954
wind_speed       315.546244
weather_code       2.722752
is_holiday         0.022051
is_weekend         0.285403
season             1.492075
hour              11.513265
dtype: float64

In [70]:
df2.apply(lambda x: x.mean(),axis=1 ) #Promedio de las filas

0         32.300
1         26.750
2         24.250
3         18.400
4         19.325
          ...
17409    151.500
17410    109.600
17411    102.650
17412     86.500
17413     73.300
Length: 17414, dtype: float64

In [72]:
df2.apply(lambda x: x["t1"] - x["t2"], axis=1) # A traves de una lambda hago la resta entre dos columnas

0        1.0
1        0.5
2        0.0
3        0.0
4        2.0
        ...
17409    4.0
17410    4.0
17411    4.0
17412    4.0
17413    4.0
Length: 17414, dtype: float64

In [73]:
df2["t1"] - df2["t2"]

0        1.0
1        0.5
2        0.0
3        0.0
4        2.0
        ...
17409    4.0
17410    4.0
17411    4.0
17412    4.0
17413    4.0
Length: 17414, dtype: float64

In [74]:
df2.applymap(lambda x: x/1000) # Applymap le aplica a cada campo del dataframe

         cnt      t1      t2     hum  ...  is_holiday  is_weekend  season   hour
0      0.182  0.0030  0.0020  0.0930  ...         0.0       0.001   0.003  0.000
1      0.138  0.0030  0.0025  0.0930  ...         0.0       0.001   0.003  0.001
2      0.134  0.0025  0.0025  0.0965  ...         0.0       0.001   0.003  0.002
3      0.072  0.0020  0.0020  0.1000  ...         0.0       0.001   0.003  0.003
4      0.047  0.0020  0.0000  0.0930  ...         0.0       0.001   0.003  0.004
...      ...     ...     ...     ...  ...         ...         ...     ...    ...
17409  1.042  0.0050  0.0010  0.0810  ...         0.0       0.000   0.003  0.019
17410  0.541  0.0050  0.0010  0.0810  ...         0.0       0.000   0.003  0.020
17411  0.337  0.0055  0.0015  0.0785  ...         0.0       0.000   0.003  0.021
17412  0.224  0.0055  0.0015  0.0760  ...         0.0       0.000   0.003  0.022
17413  0.139  0.0050  0.0010  0.0760  ...         0.0       0.000   0.003  0.023

[17414 rows x 10 columns]